tap "alexsjones/llmfit"
tap "buo/cask-upgrade"
tap "iina/mpv-iina"
tap "pot-app/tap"
tap "rich1e/kit-tap", "git@github.com:rich1e/kit-tap.git"
# Record and share terminal sessions
brew "asciinema"
# Shell extension to jump to frequently used directories
brew "autojump"
# Light UNIX download accelerator
brew "axel"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern, maintained replacement for ls
brew "eza"
# Interactive git commands in the terminal
brew "forgit"
# Distributed revision control system
brew "git"
# Tool Command Language
brew "tcl-tk"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# Go version management
brew "goenv"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Manage your Java environment
brew "jenv"
# Peer-to-peer hypermedia protocol
brew "kubo"
# Simple terminal UI for git commands
brew "lazygit"
# Lets you manipulate the signature block in a Mach-O binary
brew "ldid"
# Find what models run on your hardware
brew "llmfit"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Deep clean and optimize your Mac
brew "mole"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Fast, disk space efficient package manager
brew "pnpm"
# Python version management
brew "pyenv"
# Cross-platform application and UI framework
brew "qt@5"
# Cross-shell prompt for astronauts
brew "starship"
# Programmatically correct mistyped console commands
brew "thefuck"
# Powerful time tracking tool for the command-line
brew "tock"
# CLI tool that moves files or folder to the trash
brew "trash"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Why is this running?
brew "witr"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Enable Windows-like alt-tab
cask "alt-tab"
# Command-line tools for building and debugging Android apps
cask "android-commandlinetools"
# Tools for building Android applications
cask "android-studio"
# Private desktop AI chat application
cask "anythingllm"
# Inspect application bundles
cask "apparency"
# Application uninstaller
cask "appcleaner"
# Cloud storage service
cask "baidunetdisk"
# Utility to create and modify archives
cask "betterzip"
# Compare files and folders
cask "beyond-compare"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Node-based image, video and audio generator
cask "comfyui"
# Write, edit, and chat about your code with AI
cask "cursor"
# Drag and drop helper app
cask "rich1e/kit-tap/dropshelf"
# Collaborative team software
cask "figma"
# Screenshot software with built-in annotation tools
cask "flameshot"
cask "font-consolas-for-powerline"
cask "font-dejavu-sans-mono-for-powerline"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-for-powerline"
cask "font-fira-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-meslo-for-powerline"
cask "font-meslo-lg-nerd-font"
cask "font-powerline-symbols"
cask "font-sauce-code-pro-nerd-font"
cask "font-source-code-pro-for-powerline"
# Mind mapping and knowledge management software
cask "freeplane"
# Free and open-source image editor
cask "gimp"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Web browser
cask "google-chrome"
# HTML editor
cask "hbuilderx"
# Free and open-source media player
cask "iina"
# Tool for multi-language users
cask "input-source-pro"
# App for (re)signing iOS apps and bundling them
cask "ios-app-signer"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar calendar
cask "itsycal"
# Menu bar manager
cask "jordanbaird-ice"
# Open-source screen recorder built with web technology
cask "kap"
# File archiver
cask "keka"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Animated screen capture application
cask "licecap"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Decentralised blogs and websites powered by IPFS and Ethereum Name System
cask "planet"
# Collaboration platform for API development
cask "postman"
# Cross-platform software for text translation and recognize
cask "pot-app/tap/pot"
# Quick Look plugin for mobile apps and provisioning profiles
cask "provisionql"
# Quick Look plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin for plaintext files without an extension
cask "qlstephen"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# Quick Look plugin for CSV files
cask "quicklook-csv"
# Quick Look plugin for JSON files
cask "quicklook-json"
# Quick Look plugin for Adobe Photoshop pattern files
cask "quicklook-pat"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# PDF reader and note-taking application
cask "skim"
# System monitor for the menu bar
cask "stats"
# Application for inspecting installer packages
cask "suspicious-package"
# App to switch hosts
cask "switchhosts"
# Quicklook extension for source files
cask "syntax-highlight"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@11"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@17"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@19"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@20"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@8"
# Open-source code editor
cask "visual-studio-code"
# Quick Look plugin for webp files
cask "webpquicklook"
# Wechat DevTools for Official Account and Mini Program development
cask "wechatwebdevtools"
vscode "antfu.iconify"
vscode "antfu.unocss"
vscode "anthropic.claude-code"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "evils.uniapp-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.copilot-chat"
vscode "gruntfuggly.todo-tree"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "knisterpeter.vscode-commitizen"
vscode "lokalise.i18n-ally"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-json5"
vscode "mrmlnc.vscode-less"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "openai.chatgpt"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "uni-helper.uni-app-schemas-vscode"
vscode "uni-helper.uni-app-snippets-vscode"
vscode "uni-helper.uni-cloud-snippets-vscode"
vscode "uni-helper.uni-helper-vscode"
vscode "uni-helper.uni-highlight-vscode"
vscode "uni-helper.uni-ui-snippets-vscode"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "yzhang.markdown-all-in-one"
